In [1]:
import pandas as pd

In [ ]:
s1=[1,2,3,4]
s=pd.Series(s1,index=['A','B','C','D'])
print(s)

In [ ]:
d=[[1,2,3,4],[5,6,7,8]]
dt=pd.DataFrame(d,index=['A','B'],columns=['a','b','c','d'])
print(dt)

In [ ]:
df=pd.read_csv("titanic.csv")
df

In [ ]:
df.shape

In [ ]:
len(df)

In [ ]:
df.head(10)

In [ ]:
df.sample(10)

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.info()

In [ ]:
df[["Name","Age","Survived"]]

In [ ]:
df.loc[[0,100,200],["Age","Name","PassengerId"]]

In [ ]:
df.iloc[:5,:3]

In [ ]:
x=df.iloc[:,:-1]
y=df.iloc[:,-1]

In [ ]:
x

In [ ]:
y

In [ ]:
#df["Sex"]=="Male"
df[(df["Sex"]=="female") &(df["Age"]>30)]

In [ ]:
df["Embarked"].unique()

In [ ]:
df["Sex"].value_counts()

In [ ]:
df.isnull().sum()

In [ ]:
df.drop("Cabin",axis=1)

In [ ]:
df["Age"].mode()
df["Age"].mean()
df["Age"].median()

In [20]:
cols=["Name","USN","Marks1","Marks2","Marks3","Totalscore","Pass/Fail"]

In [21]:
s=[["SHASHANK",47,90,90,90,270,"Pass"],["SHASHI",48,80,80,80,240,"Pass"],["SHARATH",30,69,69,69,207,"Pass"]]

In [22]:
df=pd.DataFrame(s,columns=cols)

In [23]:
df

       Name  USN  Marks1  Marks2  Marks3  Totalscore Pass/Fail
0  SHASHANK   47      90      90      90         270      Pass
1    SHASHI   48      80      80      80         240      Pass
2   SHARATH   30      69      69      69         207      Pass

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   USN         3 non-null      int64
 2   Marks1      3 non-null      int64
 3   Marks2      3 non-null      int64
 4   Marks3      3 non-null      int64
 5   Totalscore  3 non-null      int64
 6   Pass/Fail   3 non-null      object
dtypes: int64(5), object(2)
memory usage: 300.0+ bytes

In [32]:
d1={
  "Name":["John","Henna","Ram","Peter","Alissa"],
    "Age":[22,35,34,18,25],
    "Sex":["male","female","male","male","female"]
}
d1=pd.DataFrame(d1)  
d1

     Name  Age     Sex
0    John   22    male
1   Henna   35  female
2     Ram   34    male
3   Peter   18    male
4  Alissa   25  female

In [33]:
d2={
  "Name":["Cena","Robert","Ram","Peter","Alissa"],
    "Jobrole":["SE","HD","CEO","CTO","Mentor"],
    "Salary":[20000,4500,56678,787800,12000]
}
d2=pd.DataFrame(d2)
d2

     Name Jobrole  Salary
0    Cena      SE   20000
1  Robert      HD    4500
2     Ram     CEO   56678
3   Peter     CTO  787800
4  Alissa  Mentor   12000

In [35]:
pd.merge(d1,d2,how='outer', on='Name')

     Name   Age     Sex Jobrole    Salary
0    John  22.0    male     NaN       NaN
1   Henna  35.0  female     NaN       NaN
2     Ram  34.0    male     CEO   56678.0
3   Peter  18.0    male     CTO  787800.0
4  Alissa  25.0  female  Mentor   12000.0
5    Cena   NaN     NaN      SE   20000.0
6  Robert   NaN     NaN      HD    4500.0